webappAnsTiss/Web References/wsTissComunicacaoBeneficiario/tissComunicacaoBeneficiario.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:ans="http://www.ans.gov.br/padroes/tiss/schemas" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.ans.gov.br/tiss/ws/tipos/tisscomunicacaobeneficiario/v30303" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns="http://schemas.xmlsoap.org/wsdl/" name="tissComunicacaoBeneficiario" targetNamespace="http://www.ans.gov.br/tiss/ws/tipos/tisscomunicacaobeneficiario/v30303" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema xmlns="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap11-enc="http://schemas.xmlsoap.org/soap/encoding/">
      <xsd:import schemaLocation="tissWebServicesV3_03_03.xsd" namespace="http://www.ans.gov.br/padroes/tiss/schemas" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="tissComunicacaoBeneficiario_Request">
    <wsdl:part name="comunicacaoBeneficiario" element="ans:comunicacaoBeneficiarioWS" />
  </wsdl:message>
  <wsdl:message name="tissComunicacaoBeneficiario_Response">
    <wsdl:part name="reciboComunicacao" element="ans:reciboComunicacaoWS" />
  </wsdl:message>
  <wsdl:message name="tissFault">
    <wsdl:part name="tissFault" element="ans:tissFaultWS" />
  </wsdl:message>
  <wsdl:portType name="tissComunicacaoBeneficiario_PortType">
    <wsdl:operation name="tissComunicacaoBeneficiario_Operation">
      <wsdl:input message="tns:tissComunicacaoBeneficiario_Request" />
      <wsdl:output message="tns:tissComunicacaoBeneficiario_Response" />
      <wsdl:fault name="TissFault" message="tns:tissFault" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="tissComunicacaoBeneficiario_Binding" type="tns:tissComunicacaoBeneficiario_PortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="tissComunicacaoBeneficiario_Operation">
      <soap:operation soapAction="" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
      <wsdl:fault name="TissFault">
        <soap:fault use="literal" name="TissFault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="tissComunicacaoBeneficiario">
    <wsdl:port name="tissComunicacaoBeneficiario_Port" binding="tns:tissComunicacaoBeneficiario_Binding">
      <soap:address location="" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>